{"meta":{"title":"Glauber","subtitle":"Web Developer","description":"blog do Glauber, desenvolvedor web e entusiasta de front-end","author":"Glauber Cezar","url":"http://yoursite.com"},"pages":[{"title":"Sobre mim","date":"2016-04-23T23:40:47.609Z","updated":"2016-04-23T23:40:47.521Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","keywords":null,"text":"Olá! meu nome é Glauber, tenho 25 anos, sou desenvolvedor web e entusiasta de desenvolvimento front-end e tecnologias open sorce. Eu comecei a “brincar” com códigos em meados de 2010 e trabalhar profissionalmente “nem tanto rs” neste mesmo ano em uma agência de criação e desenvolvimento web fundada em parceria com um colega. Atualmente estou me dedicando aos estudos a fim de terminar minha faculdade, cursando Análise e Desenvolvimento de Sistemas. De vez em quando realizo alguns serviços como freelancer, e tentando manter alguns hábitos: Sempre contribuir com a comunidade em projetos no meu Github Codificar diariamente Aprender novas tecnologias e manter-se por dentro das novidades Minhas HabilidadesDesenvolvimento Front-end HTML/HTML5 CSS/CSS3 Javascript Ferramentas e metodologias Front-end Pré-processadores de CSS (SASS, Stylus, Less) CSS Frameworks (Bootstrap, Foundation, e outros) Design Responsivo (Mobile First) Metodologias de Front-end (Atomic design, BEM CSS e outros) Static Generators (Hexo) Bibliotecas e Frameworks JS (jQuery e AngularJS) JS Task Runners (Gulp) Gerenciamento de dependências (Bower e npm) Versionamento de projetos Git GitHub Bitbucket Desenvolvimento Back-end e Banco de dados PHP/PHP5 PHP Frameworks (CodeIgniter) PHP CMS (WordPress) MySQL e MongoDB (Básico) NodeJS (básico) Desenvolvimento Ágil Scrum Kanban Sistema Operacionais Unix commands Linux (Debian, Ubuntu, Mint, ElementaryOS e outros) Windows E por fim, para entrar em contato comigo basta enviar um e-mail para glauber[at]criandopraweb.com ou me procurar em uma das minhas redes sociais.","raw":null,"content":null},{"title":"Tags","date":"2016-04-23T07:33:01.102Z","updated":"2016-04-23T06:23:08.000Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","keywords":null,"text":"","raw":null,"content":null},{"title":"Categories","date":"2016-04-23T07:33:01.094Z","updated":"2016-04-23T06:23:08.000Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","keywords":null,"text":"","raw":null,"content":null}],"posts":[{"title":"No mundo cada vez mais moderno","slug":"No-mundo-cada-vez-mais-moderno","date":"2016-04-23T22:24:27.000Z","updated":"2016-04-23T23:01:44.017Z","comments":true,"path":"2016/04/23/No-mundo-cada-vez-mais-moderno/","link":"","permalink":"http://yoursite.com/2016/04/23/No-mundo-cada-vez-mais-moderno/","excerpt":"A tecnologia evoluiu bastante nos últimos tempos, hoje ela está presente na vida das pessoas, no meio corporativo e de grandes negócios e nas mais diversas áreas tendo principalmente o papel de facilitar e solucionar diversos tipos de problemas.","keywords":null,"text":"A tecnologia evoluiu bastante nos últimos tempos, hoje ela está presente na vida das pessoas, no meio corporativo e de grandes negócios e nas mais diversas áreas tendo principalmente o papel de facilitar e solucionar diversos tipos de problemas. A tecnologia exerce grande influência no mundo dos negóciosEm um mundo cada vez mais moderno se destacam as organizações/instituições que fazem bom uso da tecnologia da informação (TI), isso não significa adotá-la apenas por necessidade, já que serve como apoio às áreas executivas, gerenciais e operacionais, mas utilizá-la de forma estratégica, permitindo que estas organizações atinjam seus objetivos internos e externos, alcançando melhores resultados e sucesso no mercado, isso pode se dar através da análise de informações precisas quando necessárias, acompanhamento em tempo real do desempenho corporativo, utilização de bons sistemas de processamento de transações (SPTs), sistemas de informações gerenciais (SIGs), sistemas de apoio a decisão (SADs), entre outros… Empresas com soluções que envolvem diretamente clientes ou usuários finais, seja para informar, interagir ou realizar alguma transação, devem ficar atentas às inovações e pensar sempre na experiência do usuário ao utilizar tal solução, permitindo que esta seja simples, fácil e atenda as necessidades, neste cenário os aplicativos móveis se destacam devido as facilidades e vantagens que smartphones e tablets oferecem. As pessoas tem acesso à inúmeros benefícios e facilidadesNo mundo cada vez mais moderno, o surgimento de tecnologias como o smartphone (telefone inteligente, em tradução livre), os aplicativos para estes dispositivos e a internet móvel proporcionam às pessoas inúmeros benefícios e facilidades. O smartphone tem se tornado um bem de uso essencial, graças às distintas funções que este exerce por meio dos programas ou aplicativos (apps), algo que antes só era possível através de um computador, tem revolucionado a vida de muitas pessoas, pois não importa o local em que o usuário esteja (casa, trabalho, rua, praia) é fácil se conectar e realizar uma infinidade de tarefas como enviar mensagens, jogar, acessar a conta bancária, criar documentos, acessar sites, ler notícias e muito mais, há aplicativos para todos os gostos com diversas opções para entretenimento, informação, realização de atividades rotineiras, profissionais e educativas, entre outros, muitos com o objetivo de solucionar um problema específico. As coisas são conectadasNo mundo cada vez mais moderno o conceito de internet das coisas se torna realidade, graças a tecnologias como RFID (Radio Frequency IDentification), conexão 5G, o investimento e apoio de grandes empresas como Google, Microsoft, Intel, Apple e Samsung, entre outras. Através de dispositivos e objetos que comunicam entre si, surgirão novas possibilidades como: Na área da saúde, a tecnologia “vestível” (ou wearables) que permite monitorar batimentos cardíacos, temperatura do corpo, entre outros. Na indústria automotiva carros inteligentes que permitem o condutor ligar o motor, controlar luzes e climatização, verificar nível de combustível antes mesmo de adentrá-lo. Cidades inteligentes, com sensores que coletam dados e enviam para um centro de processamento e armazenamento de informações.Etc…","raw":null,"content":null,"categories":[{"name":"Meditando","slug":"Meditando","permalink":"http://yoursite.com/categories/Meditando/"}],"tags":[]}]}